// - інтерпретований (interpreted):
// інтерпретатор читає код програми рядок за рядком і виконує його "як є" 

// - однопотоковий (single thread):
// JS може виконувати лише 1 функцію за 1 раз

// - слаботипізований (loosely typed):
// Слабка (динамічна) типізація - це коли змінна може міняти свій тип в 
// залежності від значення що їй присвоюється

// - мультипародигменний (multi-paradigm)
// В JS можна писати в різних стилях. В Об'єктоорієнтованому стилі (класи,
// об'єкти, наслідування), в функціональному (композиція, чисті функції)

// - кросплатформенний (cross platform) 
// JS можна виконувати як на клієнті так і на сервері

// - з автоматичним керуванням пам'яттю (automatic memory management)
// JS інтерпретатор сам автоматично керує пам'яттю та її очищенням.
// Спеціальний процес називається "прибиранням сміття" (garbage collector).